app/controllers/application_controller.rb

SELECT "students".* FROM "students"  ORDER BY last_requested_help_at DESC
---
  def index
    @students = Student.all