app/controllers/application_controller.rb

SELECT COUNT(*) FROM "contacts" WHERE (completed_at IS NULL)
---
  def index
    # Students ordered by when they last needed help
    @students = Student.all.order("last_requested_help_at DESC")
    @new_requests_count = Contact.where("completed_at IS NULL").count