app/controllers/contacts_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "contacts" ("student_id", "requested_at", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["student_id", 1], ["requested_at", "2015-03-20 23:26:06.474150"], ["created_at", "2015-03-20 23:26:06.474669"], ["updated_at", "2015-03-20 23:26:06.474669"]]
UPDATE "students" SET "last_requested_help_at" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_requested_help_at", "2015-03-20 23:34:57.436415"], ["updated_at", "2015-03-20 23:34:57.441512"], ["id", 1]]
---
  def create
    # params[:contact][:student_id]
    @student = Student.find(params[:student_id])
    contact = @student.contacts.new
    contact.requested_at = Time.now

    if contact.save
      # Update cache counter for ordering students in application#index
      @student.update_attributes(last_requested_help_at: contact.requested_at)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "contacts" SET "completed_at" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["completed_at", "2015-03-20 23:44:02.833849"], ["updated_at", "2015-03-20 23:44:02.834857"], ["id", 2]]
---
  def update
    # params[:contact][:student_id]
    @student = Student.find(params[:student_id])
    contact = Contact.find(params[:id])
    contact.completed_at = Time.now

    if contact.save